import React from "react";

import Slider from "./slider";
// import Paragraph from "../../components/p-array";

export default function Seduction() {
  return (
    <div>
      {/* <Paragraph
        content={[
          "Вас давно интересует мир моды и стиля! Вы активные и современные. Вы хотите изменить скучную профессию на новую. Вы хотите изменить себя и помогать меняться другим. Тогда Вы выбрали правильное направление. После обучения жизнь точно не будет такой, как раньше.",
          "Вы сможете не только консультировать по стилю, вы будете писать о стиле, снимать стиль, создавать стиль и даже обучать стилю!",
          "Позвольте себе это, быть у истоков, реализовать себя в творческой и модной индустрии. Тем более, что это доступно, надо просто начать."
        ]}
      /> */}
      <Slider />
    </div>
  );
}
